<a href="https://colab.research.google.com/github/omyahro/Data_200_Royals/blob/main/Class_Building_Relational_DB.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Building Databases with SQL in Python
We will begin with a csv file, recall this is a collection of data with each value separated by commas. The data can be many rows long and each row is a **record**. Each column in the data represents a **field** in a database. The underlying structure for a database is present in the csv or xlsx file.

## Importing the Libraries
To create a database in Python, we will introduce a new library, SQLite3. As this is your first use of this library, we need to use the `pip install sqlite-database` method to install the library and then import it for use. We will use a Python dependency library, csv, to handle the I/O tools for comma-separated value files.

SQLite is a C library that provides a lightweight disk-based database that doesnâ€™t require a separate server process and allows accessing the database using a nonstandard variant of the SQL query language. https://www.sqlite.org/about.html

In [3]:
pip install sqlite-database

Collecting sqlite-database
  Downloading sqlite_database-0.7.2-py3-none-any.whl.metadata (4.2 kB)
Downloading sqlite_database-0.7.2-py3-none-any.whl (36 kB)
Installing collected packages: sqlite-database
Successfully installed sqlite-database-0.7.2

In [2]:
# Import the libraries
import sqlite3
import csv
import numpy as np
import pandas as pd

## Establishing a Connection
The first step in database creation is to establish a connection to the data and the cursor that will allow you to navigate the database and run commands. When connecting to a database, you can enter the name of an existing database or designate a filename to create a new database.

Syntax: `sqlite3.connect(database, timeout=5.0,
detect_types=0, isolation_level='DEFERRED',
check_same_thread=True, factory=sqlite3.Connection,
cached_statements=128, uri=False, *,
autocommit=sqlite3.LEGACY_TRANSACTION_CONTROL)`

We simplify the full syntax to include the name of the database. The additional parameters and a detailed explanation on when to use them is located here: https://docs.python.org/3/library/sqlite3.html#sqlite3-reference

In [4]:
# Create a connection
# Syntax: conn = sqlite3.connect('databaseName.sqlite')
conn = sqlite3.connect('energyindicators.sqlite')

# Create a cursor object to navigate
cur = conn.cursor()

# SQL Basics

## Creating Tables
The database is comprised of tables that add structure and store the data. The next step is to create a table that holds the data we would like to use from the CSV file. The data in the CSV may have a first row that designates the names of the fields, or it may consist of just the data without column headers. The field names are defined using a `CREATE TABLE` method to synchronize the fields with the column names.

When creating the table fields, the field's data type must be designated. In Python, we have string; in SQL, we have TEXT.

The following Python types can thus be sent to SQLite without any problem:
<table>
  <thead>
    <tr>
      <th>Python type</th>
      <th>SQLite type</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>None</td>
      <td>NULL</td>
    </tr>
    <tr>
      <td>int</td>
      <td>INTEGER</td>
    </tr>
    <tr>
      <td>float</td>
      <td>REAL</td>
    </tr>
    <tr>
      <td>str</td>
      <td>TEXT</td>
    </tr>
    <tr>
      <td>bytes</td>
      <td>BLOB</td>
    </tr>
  </tbody>
</table>

You can also create a dictionary in Python and pass this to the `CREATE TABLE` method to include the field names for the table.

Example:<br>

       CREATE TABLE students(
       name TEXT,
       age INTEGER,
       grade INTEGER
       );

In [20]:
# Create a cursor to interact with the database.
cur.execute('''DROP TABLE graduates''')

In [7]:
# Create a new table named students
# Table fields will be name, graduation year, and school
cur.execute('''
CREATE TABLE graduates(
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    graduated INTEGER,
    school TEXT
   )
   ''')

## Inserting Data Into Tables
The tables consist of records, these are the data points that make up each row of the DataFrame. The records is a single entry into the table as a horizonal row of data. The record contains data that is matched to the field in the table. Recall that the fields in the table are similar to the columns in the dataframe. The columm names were designated when the table was created. In our example above this includes a unique id field that automatically numbers (think indexing in Python) each incoming record. The remaining fields are the names of our variables. Adding data to the table uses the `INSERT INTO` statement. The syntax includes the name of the table where the data should be inserted and the corresponding field (column) names for each data point.

`INSERT INTO`: This command is used to insert new data into a table. <br>
Example:<br>

        INSERT INTO students (name, age, grade)
        VALUES ("John Doe", 20, 12);

If data is added to each field of the table the field names do not need to be declared. However, it is best practice to list the column names so that when there are null values for a field the value is skipped accordingly.

Our list of students includes just a few of the essential students who shaped Black History. This list is by no means comprehensive, so we will have the opportunity to add to it in class.

<table>
    <thead>
        <tr>
            <th>Student Name</th>
            <th>Graduation Year</th>
            <th>School</th>
            <th>Personal Description</th>
        </tr>
    </thead>
    <tbody>
    <tr>
        <td>Shirley Chisholm</td>
        <td>1951</td>
        <td>Columbia University</td>
        <td>The first African American woman to serve in Congress and run for president.</td>
    </tr>
    <tr>
        <td>KimberlÃ© Crenshaw</td>
        <td>1989</td>
        <td>Columbia University</td>
        <td>The Columbia Law Professor who coined the term "intersectionality".</td>
    </tr>
    <tr>
        <td>Barack Obama</td>
        <td>1983</td>
        <td>Columbia University</td>
        <td>The first African American president of the United States, who studied political science and international relations at Columbia.</td>
    </tr>
    <tr>
        <td>Mae Jemison</td>
        <td>1981</td>
        <td>Cornell University School of Medicine</td>
        <td>The first African American woman to orbit into space, and also a physician, teacher, and Peace Corps volunteer.</td>
    </tr>
    <tr>
        <td>Bessie Coleman</td>
        <td>NULL</td>
        <td>Langston Industrial College</td>
        <td>The only Black student and woman in her flying class, who was the first Black Female pilot.</td>
    </tr>
    <tr>
        <td>Langston Hughes</td>
        <td>1929</td>
        <td>Lincoln University</td>
        <td>A major poet, novelist, short story writer, essayist, and playwright who was a central figure in the Harlem Renaissance.</td>
    </tr>
    <tr>
        <td>Maya Angelou</td>
        <td>1944</td>
        <td>Mission High School</td>
        <td>A civil rights activist who worked for Dr. Martin Luther King Jr. and Malcolm X was a singer, dancer, actress, composer, and Hollywood's first female Black director.</td>
    </tr>
    <tr>
        <td>Zora Neale Hurston</td>
        <td>1928</td>
        <td>Columbia University</td>
        <td>The first Black student to attend Barnard College, where she studied anthropology with Franz Boas.</td>
    </tr>
    <tr>
        <td>Claudette Colvin</td>
        <td>NULL</td>
        <td>Booker T Washington High School</td>
        <td>A 15-year-old Black student in Montgomery, Alabama, in 1955 who refused to give up her seat on a segregated bus.</td>
    </tr>
    <tr>
        <td>Martin Luther King Jr.</td>
        <td>1948</td>
        <td>Morehouse College</td>
        <td>Activist and influential student who was elected president of his class in his final year of college.</td>
    </tr>
    <tr>
        <td>Ruby Bridges</td>
        <td>NULL</td>
        <td>Kansas City Business School</td>
        <td>The first African American child to attend a predominantly white elementary school in 1960 New Orleans, Louisiana.</td>
    </tr>

Here are a few more HBCU graduates to add to the table. <br>
Fmr. Vice President Kamala Harris (Howard University, 1986), Langston Hughes (Lincoln University, 1929), Samuel L. Jackson (Morehouse College, 1972), Lionel Richie, (Tuskegee University, 1974) and Oprah Winfrey (Tennessee State University, 1986), Katherine Johnson (West Virginia State University, 1937), George Alcorn (Howard University, 1963, 1967), Reverend Jesse Jackson (North Carolina A&T State University, 1964), W.E.B. Du Bois (Fisk University, 1888), Janice Bryant Howroyd (North Carolina A&T State University), Earl G. Graves Sr. (Morgan State University, 1958), Bob Hayes (Florida A&M University, 1964), Althea Gibson (Florida A&M University, 1953), Spike Lee (Morehouse College, 1979), Ret. Chief Justice Henry Frye(North Carolina A&T State University, 1953), Dr. Ronald E McNair (North Carolina A&T State University, 1971).

In [8]:
# Let's insert a record into the table
cur.execute('''
INSERT INTO graduates (name, graduated, school) VALUES ('Shirley Chisholm', 1951, 'Columbia University')''')
conn.commit()

In [9]:
# Let's import more than one data into the table
# Start with a list for the data
data = [('Kimberle Crenshaw', 1989, 'Columbia University'),
        ('Barack Obama', 1983, 'Columbia University'),
        ('Mae Jemison', 1981, 'Cornell University School of Medicine'),
        ('Bessie Coleman','NULL' ,'Langston Industrial College'),
        ('Langston Hughes', 1929, 'Lincoln University'),
        ('Maya Angelou', 1944, 'Mission High School'),
        ('Zora Neale Hurston', 1928, 'Columbia University'),
        ('Claudette Colvin','NULL' , 'Booker T Washington High School'),
        ('Martin Luther King Jr', 1948, 'Morehouse College'),
        ('Audre Lorde', 1961, 'Columbia University'),
        ('Ruby Bridges','NULL' , 'Kansas City Business School'),
       ('LaKeta L Kemp', 2024, 'Howard University')]

# Now let's add the data as new records.
cur.executemany('''
INSERT INTO graduates (name, graduated, school) VALUES (?, ?, ?)''',data)
conn.commit()

## Querying the new table: the SELECT Statement
The collection of data can be searched and the matches returned using the `SELECT` statement. This is the command used to select specific data from the table and return it to the user. The data can be stored as a variable and later as a dataframe to manipulate with Pandas. Multiple criteria can be looped together with the `SELECT` statement to narrow down the results. Take care in the string order for the commands. Adding too many items together can restrict the results down to a few or even no results. The basic `SELECT` statement requires the field names and the name of the table.

`SELECT`: This command is used to select data from a table. <br>
Example:<br>

        SELECT name, age
        FROM students;
## WHERE Statements
The `WHERE` Statement is a conditional clause used to filter results in SQL. Conditions on the values selected are added with `WHERE` and a logic statement. Use the `>`, `<`, `=` and combinations to evaluate the list for the conditions.

## BETWEEN Statements
Similar to the WHERE Statement, the `BETWEEN` statement allows the selected data to be constrained between more than one condition.  This statement is used when the values are expected in an inclusive range. The range can be dates, integers, decimals, and text values.

In [10]:
# Let's use fetchall to see the entire list
cur.execute('''
SELECT *
FROM graduates;''')

cur.fetchall()

[(1, 'Shirley Chisholm', 1951, 'Columbia University'),
 (2, 'Kimberle Crenshaw', 1989, 'Columbia University'),
 (3, 'Barack Obama', 1983, 'Columbia University'),
 (4, 'Mae Jemison', 1981, 'Cornell University School of Medicine'),
 (5, 'Bessie Coleman', 'NULL', 'Langston Industrial College'),
 (6, 'Langston Hughes', 1929, 'Lincoln University'),
 (7, 'Maya Angelou', 1944, 'Mission High School'),
 (8, 'Zora Neale Hurston', 1928, 'Columbia University'),
 (9, 'Claudette Colvin', 'NULL', 'Booker T Washington High School'),
 (10, 'Martin Luther King Jr', 1948, 'Morehouse College'),
 (11, 'Audre Lorde', 1961, 'Columbia University'),
 (12, 'Ruby Bridges', 'NULL', 'Kansas City Business School'),
 (13, 'LaKeta L Kemp', 2024, 'Howard University')]

In [11]:
# Let's use fetchall to see the entire list
cur.execute('''
SELECT *
FROM graduates
LIMIT 13;''')

cur.fetchall()

[(1, 'Shirley Chisholm', 1951, 'Columbia University'),
 (2, 'Kimberle Crenshaw', 1989, 'Columbia University'),
 (3, 'Barack Obama', 1983, 'Columbia University'),
 (4, 'Mae Jemison', 1981, 'Cornell University School of Medicine'),
 (5, 'Bessie Coleman', 'NULL', 'Langston Industrial College'),
 (6, 'Langston Hughes', 1929, 'Lincoln University'),
 (7, 'Maya Angelou', 1944, 'Mission High School'),
 (8, 'Zora Neale Hurston', 1928, 'Columbia University'),
 (9, 'Claudette Colvin', 'NULL', 'Booker T Washington High School'),
 (10, 'Martin Luther King Jr', 1948, 'Morehouse College'),
 (11, 'Audre Lorde', 1961, 'Columbia University'),
 (12, 'Ruby Bridges', 'NULL', 'Kansas City Business School'),
 (13, 'LaKeta L Kemp', 2024, 'Howard University')]

In [12]:
# Let's select graduates after 1950
cur.execute('''
SELECT *
    FROM graduates
    WHERE graduated > 1950;
''')

cur.fetchall()

[(1, 'Shirley Chisholm', 1951, 'Columbia University'),
 (2, 'Kimberle Crenshaw', 1989, 'Columbia University'),
 (3, 'Barack Obama', 1983, 'Columbia University'),
 (4, 'Mae Jemison', 1981, 'Cornell University School of Medicine'),
 (5, 'Bessie Coleman', 'NULL', 'Langston Industrial College'),
 (9, 'Claudette Colvin', 'NULL', 'Booker T Washington High School'),
 (11, 'Audre Lorde', 1961, 'Columbia University'),
 (12, 'Ruby Bridges', 'NULL', 'Kansas City Business School'),
 (13, 'LaKeta L Kemp', 2024, 'Howard University')]

In [13]:
# Let's select graduates after 1950
cur.execute('''
SELECT *
    FROM graduates
    WHERE graduated = "NULL";
''')

cur.fetchall()

[(5, 'Bessie Coleman', 'NULL', 'Langston Industrial College'),
 (9, 'Claudette Colvin', 'NULL', 'Booker T Washington High School'),
 (12, 'Ruby Bridges', 'NULL', 'Kansas City Business School')]

In [14]:
# Let's select graduates between 1970 and 2000
cur.execute('''
SELECT *
    FROM graduates
    WHERE graduated BETWEEN 1970 AND 2000;
''')

cur.fetchall()

[(2, 'Kimberle Crenshaw', 1989, 'Columbia University'),
 (3, 'Barack Obama', 1983, 'Columbia University'),
 (4, 'Mae Jemison', 1981, 'Cornell University School of Medicine')]

In [15]:
# Let's select graduates between 1970 and 2000
# The BETWEEN Statement must be START AND END
cur.execute('''
SELECT *
    FROM graduates
    WHERE graduated BETWEEN 2000 AND 1970;
''')

cur.fetchall()

[]

In [16]:
# We have added Shirley Chisholm five extra times, let's remove the duplicates
# Using a SELECT Statement
cur.execute('''
SELECT DISTINCT name, graduated, school
FROM graduates;
    ''')
cur.fetchall()

[('Shirley Chisholm', 1951, 'Columbia University'),
 ('Kimberle Crenshaw', 1989, 'Columbia University'),
 ('Barack Obama', 1983, 'Columbia University'),
 ('Mae Jemison', 1981, 'Cornell University School of Medicine'),
 ('Bessie Coleman', 'NULL', 'Langston Industrial College'),
 ('Langston Hughes', 1929, 'Lincoln University'),
 ('Maya Angelou', 1944, 'Mission High School'),
 ('Zora Neale Hurston', 1928, 'Columbia University'),
 ('Claudette Colvin', 'NULL', 'Booker T Washington High School'),
 ('Martin Luther King Jr', 1948, 'Morehouse College'),
 ('Audre Lorde', 1961, 'Columbia University'),
 ('Ruby Bridges', 'NULL', 'Kansas City Business School'),
 ('LaKeta L Kemp', 2024, 'Howard University')]

In [17]:
# Deleting the actual values from the ID Number
cur.execute('''
DELETE
FROM graduates WHERE id > 12;
''')

cur.execute('''
SELECT *
FROM graduates;
''')

cur.fetchall()

[(1, 'Shirley Chisholm', 1951, 'Columbia University'),
 (2, 'Kimberle Crenshaw', 1989, 'Columbia University'),
 (3, 'Barack Obama', 1983, 'Columbia University'),
 (4, 'Mae Jemison', 1981, 'Cornell University School of Medicine'),
 (5, 'Bessie Coleman', 'NULL', 'Langston Industrial College'),
 (6, 'Langston Hughes', 1929, 'Lincoln University'),
 (7, 'Maya Angelou', 1944, 'Mission High School'),
 (8, 'Zora Neale Hurston', 1928, 'Columbia University'),
 (9, 'Claudette Colvin', 'NULL', 'Booker T Washington High School'),
 (10, 'Martin Luther King Jr', 1948, 'Morehouse College'),
 (11, 'Audre Lorde', 1961, 'Columbia University'),
 (12, 'Ruby Bridges', 'NULL', 'Kansas City Business School')]

## Importing File Data into the Database
The data is located in a CSV file that needs to be designated as the input for the data. We use SQLite3 in Python, so all our usual Python methods will also work. This includes conditional logic and loops. We can use a loop to read each CSV file row and map the values to their respective fields.

In [18]:
# Import a dataset into dataFrame
# Read the dataset
path = pd.read_csv('EnergyWorldDevelopmentIndicators_Data.csv')

# Create the Dataframe
energyIndicatorsWorld = pd.DataFrame(path)

# Read the first 15 rows of data
energyIndicatorsWorld.head(15)

FileNotFoundError: [Errno 2] No such file or directory: 'EnergyWorldDevelopmentIndicators_Data.csv'

In [ ]:
# The spaces in the column headers are a problem, let's rename the columns
# Syntax: df = df.rename(columns={'currentColumnName':'newColumnName', 'nextCurrentColumnName':'nextNewColumnName'})
energyIndicatorsWorld = energyIndicatorsWorld.rename(columns={'Country Name':'Country_Name',
                                                              'Country Code': 'Country_Code',
                                                              'Series Name': 'Series_Name',
                                                              'Series Code': 'Series_Code',
                                                              '2000':'Y2000',
                                                              '2001':'Y2001',
                                                              '2003':'Y2003',
                                                              '2004':'Y2004',
                                                              '2005':'Y2005',
                                                              '2006':'Y2006',
                                                              '2007':'Y2007',
                                                              '2008':'Y2008',
                                                              '2009':'Y2009',
                                                              '2010':'Y2010',
                                                              '2011':'Y2011',
                                                              '2012':'Y2012',
                                                              '2013':'Y2013',
                                                              '2014':'Y2014',
                                                              '2015':'Y2015',
                                                              '2016':'Y2016',
                                                              '2017':'Y2017',
                                                              '2018':'Y2018',
                                                              '2019':'Y2019',
                                                              '2020':'Y2020',
                                                              '2021':'Y2021',
                                                              '2022':'Y2022',
                                                             })

# Let's view the new columns and update the variable
# Pass the columns to the variable: Use the variable = DataFrame.columns method
energyCols = energyIndicatorsWorld.columns
# Call the variable to see the contents
energyCols

In [ ]:
# The SQL CSV Import throws an error:
# ValueError: could not convert string to float: '..'
# Let's update all the '..' to NaN then drop.

In [ ]:
# Use the cursor to DROP TABLE if it exists
cur.execute('DROP TABLE IF EXISTS energyindicators')

# Use the cursor to CREATE TABLE
cur.execute('''
CREATE TABLE "energyindicators"(
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    "Country_Name"	TEXT,
    "Country_Code"	TEXT,
    "Series_Name"	TEXT,
    "Series_Code"	TEXT,
    "Y2000"	REAL,
    "Y2001"	REAL,
    "Y2002"	REAL,
    "Y2003"	REAL,
    "Y2004"	REAL,
    "Y2005"	REAL,
    "Y2006"	REAL,
    "Y2007"	REAL,
    "Y2008"	REAL,
    "Y2009"	REAL,
    "Y2010"	REAL,
    "Y2011"	REAL,
    "Y2012"	REAL,
    "Y2013"	REAL,
    "Y2014"	REAL,
    "Y2015"	REAL,
    "Y2016"	REAL,
    "Y2017"	REAL,
    "Y2018"	REAL,
    "Y2019"	REAL,
    "Y2020"	REAL,
    "Y2021"	REAL,
    "Y2022" REAL)
    ''')

In [ ]:
# Designate the filename for the input
filename = "EnergyWorldDevelopmentIndicators_Data.csv"

# Open the file and read the data
with open(filename) as csv_file:
    csv_reader = csv.reader(csv_file, delimiter=',')
    for row in csv_reader:
        print(row)
        Country_Code =row[0] # Set the Country Code as the unique ID for Countries
        Country_Name=row[1]
        Series_Name =row[2]
        Series_Code =row[3]
        Y2000 = float(row[4])
        Y2001 = float(row[5])
        Y2002 = float(row[6])
        Y2003 = float(row[7])
        Y2004 = float(row[8])
        Y2005 = float(row[9])
        Y2006 = float(row[10])
        Y2007 = float(row[11])
        Y2008 = float(row[12])
        Y2009 = float(row[13])
        Y2010 = float(row[14])
        Y2011 = float(row[15])
        Y2012 = float(row[16])
        Y2013 = float(row[17])
        Y2014 = float(row[18])
        Y2015 = float(row[19])
        Y2016 = float(row[20])
        Y2017 = float(row[21])
        Y2018 = float(row[22])
        Y2019 = float(row[23])
        Y2020 = float(row[24])
        Y2021 = float(row[25])
        Y2022 = float(row[26])
        cur.execute('''INSERT INTO energyindicators("Country_Code", "Country_Name", "Series_Name",
            "Series_Code", Y2000, Y2001, Y2002, Y2003, Y2004, Y2005, Y2006, Y2007, Y2008, Y2009, Y2010,
            Y2011,Y2012,Y2013,Y2014, Y2015, Y2016, Y2017, Y2018, Y2019, Y2020, Y2021, Y2022)
            VALUES (?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?)''',
                    (Country_Code, Country_Name, Series_Name, Series_Code, Y2000, Y2001, Y2002, Y2003, Y2004, Y2005, Y2006, Y2007, Y2008,
        Y2009, Y2010, Y2011, Y2012, Y2013, Y2014, Y2015, Y2016, Y2017, Y2018, Y2019, Y2020, Y2021, Y2022))
        conn.commit()

In [ ]:
# Let's load our dataFrame data into a SQLite Table
energyIndicatorsWorld.to_sql('energyindicators',
                             conn,
                             if_exists='append',
                             index=False)

In [ ]:
# Let's SELECT Countries WHERE Year 2000 is BETWEEN 5 and 75
cur.execute('''
SELECT *
    FROM energyindicators
    LIMIT 10;
''')

cur.fetchall()

In [ ]:
# Let's SELECT Countries WHERE Year 2000 is BETWEEN 5 and 75
cur.execute('''
SELECT *
    FROM energyindicators
    WHERE 2000 BETWEEN 5 AND 75;
''')

cur.fetchall()